cases/F26_RINGLEB/case/0/p.template
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
// F26 Ringleb / rhoSimpleFoam.  ABSOLUTE pressure p = c^(2 gamma/(gamma-1))/gamma.
// internalField = exact p at the built mesh's own cell centres (0/C, hodograph
// inversion).  The subsonic OUTFLOW carries the single outgoing-characteristic
// condition: fixedValue = the exact p at the outflow FACE centres (a PROFILE, not
// a constant -- p varies across the outflow because V does).  The inflow is
// zeroGradient (its three conditions are U and T); the slip walls are zeroGradient
// (the standard slip wall: the wall pressure is the adjacent cell value).
dimensions      [1 -1 -2 0 0 0 0];
internalField   nonuniform List<scalar> __INTERNALFIELD__;
boundaryField
{
    inflow       { type zeroGradient; }
    outflow      { type fixedValue; value nonuniform List<scalar> __OUTFLOW__; }
    wallOuter    { type zeroGradient; }
    wallInner    { type zeroGradient; }
    frontAndBack { type empty; }
}
